# Numpy

In [1]:
import numpy as np

## 1. Write a python program to create two NumPy arrays and perform element-wise addition, subtraction, multiplication, and division.

In [2]:
arr1 = np.array([1,3,5,7,9])
arr2 = np.array([2,4,6,8,10])

print("Addition of arr1 and arr2 is ",np.add(arr1, arr2))
print("Subtraction of arr1 and arr2 is ",np.subtract(arr1, arr2))
print("Multiplication of arr1 and arr2 is ",np.multiply(arr1, arr2))
print("Division of arr1 and arr2 is ",np.divide(arr1, arr2))

Addition of arr1 and arr2 is  [ 3  7 11 15 19]
Subtraction of arr1 and arr2 is  [-1 -1 -1 -1 -1]
Multiplication of arr1 and arr2 is  [ 2 12 30 56 90]
Division of arr1 and arr2 is  [0.5        0.75       0.83333333 0.875      0.9       ]

## 2. Write a Python program to create a NumPy array containing even numbers from 2 to 20 (inclusive) and display it.

In [3]:
even_numbers = np.arange(2,21,2)

print("Even Numbers are :->",even_numbers)

Even Numbers are :-> [ 2  4  6  8 10 12 14 16 18 20]

## 3. Write a Python program using NumPy to create an array and compute the square of each element.

In [4]:
arr = np.array([1,3,5,7,9])
print("Square of numbers is",arr * arr)
print(np.square(arr))

Square of numbers is [ 1  9 25 49 81]
[ 1  9 25 49 81]

# PANDAS

In [7]:
import pandas as pd

## 1. Identify Missing Values Write a Python program using Pandas to: Load the dataset employee_performance.csv Display the total number of missing values in each column.

In [8]:
df = pd.read_csv("employee_performance.csv")
df.head()

df.isnull().sum()

EmployeeID            0
Name                  0
Department           60
Age                  60
Gender                0
Experience            0
Salary               60
Rating               60
ProjectsCompleted     0
Attendance (%)       60
dtype: int64

## 2. Replace Missing Numeric Values with Mean Replace missing values in numeric columns (Age, Salary, Rating, Attendance) with their mean values and display the updated dataset.

In [7]:
df_mean = df[['Age', 'Salary', 'Rating', 'Attendance (%)']].fillna(df[['Age', 'Salary', 'Rating', 'Attendance (%)']].mean())
df_mean

      Age    Salary    Rating  Attendance (%)
0    41.0   39816.0  4.000000           63.97
1    46.0   62240.0  3.079545           68.35
2    43.0   26276.0  3.079545           97.03
3    34.0   99530.0  3.000000           76.57
4    40.0   43499.0  4.000000           75.82
..    ...       ...       ...             ...
495  57.0  118723.0  2.000000           62.08
496  44.0   32411.0  2.000000           67.64
497  22.0   77009.0  3.079545           72.40
498  36.0   35422.0  3.000000           89.27
499  42.0   62468.0  5.000000           85.63

[500 rows x 4 columns]

In [8]:
df_mean.isnull().sum()

Age               0
Salary            0
Rating            0
Attendance (%)    0
dtype: int64

## 3. Replace Missing Numeric Values with Median Replace missing values in numeric columns with their median and compare the result with the mean-based replacement.

In [9]:
df_median = df[['Age', 'Salary', 'Rating', 'Attendance (%)']].fillna(df[['Age', 'Salary', 'Rating', 'Attendance (%)']].median())
df_median

      Age    Salary  Rating  Attendance (%)
0    41.0   39816.0     4.0           63.97
1    46.0   62240.0     3.0           68.35
2    43.0   26276.0     3.0           97.03
3    34.0   99530.0     3.0           76.57
4    40.0   43499.0     4.0           75.82
..    ...       ...     ...             ...
495  57.0  118723.0     2.0           62.08
496  44.0   32411.0     2.0           67.64
497  22.0   77009.0     3.0           72.40
498  36.0   35422.0     3.0           89.27
499  42.0   62468.0     5.0           85.63

[500 rows x 4 columns]

In [10]:
df_median.isnull().sum()

Age               0
Salary            0
Rating            0
Attendance (%)    0
dtype: int64

## 4. Replace Missing Categorical Values with Mode Replace missing values in categorical columns (Department, Gender) using their mode (most frequent value).

In [11]:
df_mode = df[['Department','Gender']].fillna(df[['Department','Gender']]).mode().iloc[0]

df_mode

Department    Finance
Gender           Male
Name: 0, dtype: object

In [12]:
df_mode.isnull().sum()

np.int64(0)

## 5. Fill Missing Values using a Fixed Value Replace all missing Rating values with a fixed value 3 (average rating).

In [13]:
df_rating = df['Rating'].fillna(3)
df_rating

0      4.0
1      3.0
2      3.0
3      3.0
4      4.0
      ...
495    2.0
496    2.0
497    3.0
498    3.0
499    5.0
Name: Rating, Length: 500, dtype: float64

## 6. Forward Fill and Backward Fill Use forward fill (ffill) and backward fill (bfill) methods to handle missing data in the dataset. Compare the results.

In [14]:
df_ffill = df.fillna(method = 'ffill')

df_bfill = df.fillna(method = 'bfill')

C:\Users\Om\AppData\Local\Temp\ipykernel_22432\2200740818.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_ffill = df.fillna(method = 'ffill')
C:\Users\Om\AppData\Local\Temp\ipykernel_22432\2200740818.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_bfill = df.fillna(method = 'bfill')

In [15]:
df_ffill.isnull().sum()

EmployeeID           0
Name                 0
Department           1
Age                  0
Gender               0
Experience           0
Salary               0
Rating               0
ProjectsCompleted    0
Attendance (%)       0
dtype: int64

In [16]:
df_ffill.isnull().sum()

EmployeeID           0
Name                 0
Department           1
Age                  0
Gender               0
Experience           0
Salary               0
Rating               0
ProjectsCompleted    0
Attendance (%)       0
dtype: int64

In [17]:
df_ffill.head()

,EmployeeID,Name,Department,Age,Gender,Experience,Salary,Rating,ProjectsCompleted,Attendance (%)
0,E001,Amit Sharma,NaN,41.0,Male,12,39816.0,4.0,12,63.97
1,E002,Neha Sharma,Marketing,46.0,Male,13,62240.0,4.0,13,68.35
2,E003,Priya Mehta,Sales,43.0,Male,23,26276.0,4.0,9,97.03
3,E004,Kiran Patil,Marketing,34.0,Male,17,99530.0,3.0,4,76.57
4,E005,Amit Reddy,Marketing,40.0,Female,3,43499.0,4.0,6,75.82

In [18]:
df_bfill.isnull().sum()

EmployeeID           0
Name                 0
Department           0
Age                  0
Gender               0
Experience           0
Salary               0
Rating               0
ProjectsCompleted    0
Attendance (%)       0
dtype: int64

## 7. Drop Missing Data Write a Python program to remove all rows containing any missing values and display the shape of the new dataset.

In [19]:
df_remove = df.dropna(how = 'any',axis = 0)

In [20]:
df_remove.shape

(262, 10)

In [9]:
df.shape

(500, 10)